// acmp №5 · Статистика
// https://acmp.ru/index.asp?main=task&id_task=5
// Сложность: 15%
//
// Вася не любит английский язык, но каждый раз старается получить хотя бы четверку за
// четверть, чтобы оставаться ударником. В текущей четверти Вася заметил следующую
// закономерность: по нечетным дням месяца он получал тройки, а по четным – четверки. Так же
// он помнит, в какие дни он получал эти оценки. Поэтому он выписал на бумажке все эти дни
// для того, чтобы оценить, сколько у него троек и сколько четверок. Помогите Васе это
// сделать, расположив четные и нечетные числа в разных строчках. Вася может рассчитывать на
// оценку 4, если четверок не меньше, чем троек.
//
// Входные данные: в первой строке входного файла INPUT.TXT записано единственное число N –
// количество элементов целочисленного массива (1 ≤ N ≤ 100). Вторая строка содержит N чисел,
// представляющих заданный массив. Каждый элемент массива – натуральное число от 1 до 31. Все
// элементы массива разделены пробелом.
//
// Выходные данные: в первую строку выходного файла OUTPUT.TXT нужно вывести числа, которые
// соответствуют дням месяцев, в которые Вася получил тройки, а во второй строке
// соответственно расположить числа месяца, в которые Вася получил четверки. В третьей строке
// нужно вывести «YES», если Вася может рассчитывать на четверку и «NO» в противном случае. В
// каждой строчке числа следует выводить в том же порядке, в котором они идут во входных
// данных. При выводе числа отделяются пробелом.
//
// Примеры (« / » — переход на новую строку):
//   5 / 4 16 19 31 2 → 19 31 / 4 16 2 / YES
//   8 / 29 4 7 12 15 17 24 1 → 29 7 15 17 1 / 4 12 24 / NO

#include <iostream>
#include <vector>

using namespace std;

int main() {
    int n, k;
    cin>>n;
    int sum_even = 0;
    int sum_odd = 0;

    vector<int> even_data;
    vector<int> odd_data;

    int result = 0;

    for (int i=0; i<n; i++) {
        cin>> k;
        if (k%2 == 0) {
            sum_even++;
            even_data.push_back(k);
        } else { 
            sum_odd++;
            odd_data.push_back(k);
        }
    }

    for (int i=0; i < odd_data.size(); i++) {
        cout << odd_data[i] << " ";
    } cout << endl;

    for (int i=0; i < even_data.size(); i++) {
        cout << even_data[i] <<  " ";
    }cout << endl;

    if (sum_even >= sum_odd) {
        result = sum_even;
        cout<< "YES"<< endl;
    } else {
        result = sum_odd;
        cout<< "NO" << endl;
    }
}