// acmp №7 · Золото племени АББА
// https://acmp.ru/index.asp?main=task&id_task=7
// Сложность: 30%
//
// Главный вождь племени Абба не умеет считать. В обмен на одну из его земель вождь другого
// племени предложил ему выбрать одну из трех куч с золотыми монетами. Но вождю племени Абба
// хочется получить наибольшее количество золотых монет. Помогите вождю сделать правильный
// выбор!
//
// Входные данные: в первой строке входного файла INPUT.TXT записаны три натуральных числа
// через пробел. Каждое из чисел не превышает 10^100. Числа записаны без ведущих нулей.
//
// Выходные данные: в выходной файл OUTPUT.TXT нужно вывести одно целое число — максимальное
// количество монет, которые может взять вождь.
//
// Примеры:
//   5 7 3 → 7
//   987531 234 86364 → 987531
//   189285 283 4958439238923098349024 → 4958439238923098349024

#include <iostream>
#include <vector>
#include <string>

using namespace std;


int main() {
    string nums[3];
    for (int i=0; i<3; i++) {
        cin >> nums[i];
    }

    string biggest_num = nums[0];

    for (int i=0; i<3; i++) {
        if (biggest_num < nums[1]) {
            biggest_num = nums[1];
        } else {
            biggest_num = nums[2];
        }
    } cout << biggest_num;

    // if (nums[0].size() > nums[1].size()) {
    //     biggest_num = nums[0];
    // } if (biggest_num.size() < nums[2].size()) {
    //     biggest_num = nums[2];
    // }
    cout << biggest_num;
}