// acmp №9 · Домашнее задание
// https://acmp.ru/index.asp?main=task&id_task=9
// Сложность: 27%
//
// Петя успевает по математике лучше всех в классе, поэтому учитель задал ему сложное
// домашнее задание, в котором нужно в заданном наборе целых чисел найти сумму всех
// положительных элементов, затем найти где в заданной последовательности находятся
// максимальный и минимальный элемент и вычислить произведение чисел, расположенных в этой
// последовательности между ними. Так же известно, что минимальный и максимальный элемент
// встречаются в заданном множестве чисел только один раз и не являются соседними. Поскольку
// задач такого рода учитель дал Пете около ста, то Петя как сильный программист смог
// написать программу, которая по заданному набору чисел самостоятельно находит решение. А
// Вам слабо?
//
// Входные данные: в первой строке входного файла INPUT.TXT записано единственное число N –
// количество элементов массива. Вторая строка содержит N целых чисел, представляющих
// заданный массив. Все элементы массива разделены пробелом. Каждое из чисел во входном
// файле, в том числе и N, не превышает 10^2 по абсолютной величине.
//
// Выходные данные: в единственную строку выходного файла OUTPUT.TXT нужно вывести два числа,
// разделенных пробелом: сумму положительных элементов и произведение чисел, расположенных
// между минимальным и максимальным элементами. Значения суммы и произведения не превышают по
// модулю 3*10^4.
//
// Примеры (« / » — переход на новую строку):
//   5 / -7 5 -1 3 9 → 17 -15
//   8 / 3 14 -9 4 -5 1 -12 4 → 26 180
//   10 / -5 1 2 3 4 5 6 7 8 -3 → 36 5040

#include <iostream>
#include <vector>

using namespace std;

int main() {
    int x;
    int data_sum = 0;
    vector<int> data;
    cin >> x;
    
    for (int i=0; i<x; i++) {
        int a;
        cin >> a;
        data.push_back(a);
    }

    for (int i = 0; i<data.size(); i++) {
        if (data[i] > 0) {
            data_sum += data[i];
        }
    }

    int min = 0;
    int max = 0;

    // max
    for (int i = 0; i<data.size(); i++) {
        if (data[i] > data[max]) {
            max = i;
        }
    }

    // min
    for (int i = 0; i<data.size(); i++) {
        if (data[i] < data[min]) {
            min = i;

        }
    }

    int left;
    int right;
    int product = 1;

    if (min < max) {
        left = min;
        right = max;
    } else {
        right = min;
        left = max;
    }

    for (int i= left+1; i<right; i++) {
        product *= data[i];
    }

    cout << data_sum << " " << product;
}