// acmp №10 · Уравнение
// https://acmp.ru/index.asp?main=task&id_task=10
// Сложность: 17%
//
// Вася в школе изучил квадратные уравнения и понял, как они легко решаются путем вычисления
// дискриминанта. Но Петя поведал ему о методе решения кубических уравнений вида A*X^3 +
// B*X^2 + C*X + D = 0. На факультативе по математике Васе задали решить около ста уравнений
// как раз такого вида. Но, к сожалению, Вася забыл формулы, о которых рассказывал ему Петя.
// Но Васе было известно, что все корни уравнений – целые числа и находятся на отрезке [-100,
// 100]. Поэтому у Васи есть шанс найти их методом перебора, но для этого ему придется
// затратить уйму времени, т.к. возможно необходимо будет осуществить перебор нескольких
// тысяч значений. Помогите Васе написать программу, которая поможет ему найти корни
// кубических уравнений!
//
// Входные данные: в единственной строке входного файла INPUT.TXT записаны 4 числа: A, B, C и
// D – целые коэффициенты кубического уравнения. Каждый коэффициент по модулю меньше 32768, A
// ≠ 0.
//
// Выходные данные: в единственную строку выходного файла OUTPUT.TXT нужно вывести через
// пробел в порядке возрастания все корни заданного кубического уравнения. Кратные корни
// следует выводить только один раз.
//
// Примеры:
//   1 -3 0 0 → 0 3
//   3 -15 18 0 → 0 2 3
//   1 -7 -33 135 → -5 3 9

#include <iostream>

using namespace std;

int main() {

    long long a,b,c,d;

    cin >> a;
    cin >> b;
    cin >> c;
    cin >> d;

    long long num;

    for (int x=-100; x <= 100; x++) {
        num=a*x*x*x + b*x*x + c*x + d;
        if (num==0) {
            cout << x << " ";
        }
    }
}
