// acmp №12 · Дачники
// https://acmp.ru/index.asp?main=task&id_task=12
// Сложность: 45%
//
// Всем известно, что дачники – народ странный, почти такой же, как и программисты. Строят
// они свои дачи непонятно где, да и выращивают там непонятно что и непонятно зачем. А уж как
// они туда добираются, это другая история: кто на автобусе, кто на электричке, кто на
// автомобиле, ну а кто-то вовсе пешком ходит от дома и до самого участка. Так что не стоит
// удивляться, если вдруг Вы узнаете, что некое садоводческое товарищество располагается на
// острове, а дачники добираются до него самолетом. Да еще и на этом острове может не быть
// посадочной полосы, так что высадиться на остров можно, только прыгая с парашютом (мы уж не
// рассматриваем то, как они возвращаются с дач домой). Рассмотрим этот уникальный случай.
// Пилот всегда старается осуществить высадку парашютистов таким образом, чтобы дачники
// приземлялись как можно ближе к своим прямоугольным участкам. Пилоту интересно знать:
// сколько дачников приземлится на свои участки? Помогите ему решить эту задачу!
//
// Входные данные: в первой строке входного файла INPUT.TXT записано натуральное число N (1 ≤
// N ≤ 1000) – количество дачников, далее идут N строк, в каждой из которых описаны
// координаты каждого дачника и его участка: X Y X1 Y1 X2 Y2 X3 Y3 X4 Y4, где (X,Y) –
// координаты приземления парашютиста, (X1, Y1, X2, Y2, X3, Y3, X4, Y4) – координаты
// прямоугольного участка на плоскости, указанные последовательно. Все координаты – целые
// числа, не превышающие 50000 по абсолютной величине.
//
// Выходные данные: в выходной файл OUTPUT.TXT нужно вывести количество дачников,
// приземлившихся на свой участок. Попадание на границу участка считается попаданием на
// участок.
//
// Пример (« / » — переход на новую строку):
//   3 / 6 6 3 6 6 9 8 7 5 4 / 13 5 9 2 9 8 12 8 12 2 / 3 2 2 1 2 3 6 3 6 1 → 2

#include <iostream>
#include <string>
#include <cstdlib>

using namespace std;

long long area(long long ax, long long ay, long long bx, long long by, long long cx, long long cy) {
    return abs((bx - ax) * (cy - ay) - (cx - ax) * (by - ay));
}

int main() {
    int n;
    cin >> n;

    long long x, y, x1, y1, x2, y2, x3, y3, x4, y4;

    int count_n =0;

    for (int i=0; i<n; i++) {
        cin >> x >> y >> x1 >> y1 >> x2 >> y2 >> x3 >> y3 >> x4 >> y4;

        long long result_plot = area(x1, y1, x2, y2, x3, y3);
        long long sum = area( x,y, x1,y1, x2,y2 )
                            + area( x,y, x2,y2, x3,y3 )
                            + area( x,y, x3,y3, x4,y4 )
                            + area( x,y, x4,y4, x1,y1 );

        if (sum == 2 * result_plot) {
            count_n++;
        }
    }

    cout << count_n;
}
