// acmp №14 · НОК
// https://acmp.ru/index.asp?main=task&id_task=14
// Сложность: 19%
//
// Требуется написать программу, определяющую наименьшее общее кратное (НОК) чисел a и b.
//
// Входные данные: в единственной строке входного файла INPUT.TXT записаны два натуральных
// числа А и В через пробел, не превышающих 46340.
//
// Выходные данные: в единственную строку выходного файла OUTPUT.TXT нужно вывести одно целое
// число — НОК чисел А и В.
//
// Примеры:
//   36 27 → 108
//   39 65 → 195

#include <iostream>
#include <numeric>

using namespace std;


int main() {
    long long a, b;
    cin >> a;
    cin >> b;

    long long nok = lcm(a,b);

    cout << nok;
}
