// acmp №15 · Дороги
// https://acmp.ru/index.asp?main=task&id_task=15
// Сложность: 18%
//
// В галактике «Milky Way» на планете «Snowflake» есть N городов, некоторые из которых
// соединены дорогами. Император галактики «Milky Way» решил провести инвентаризацию дорог на
// планете «Snowflake». Но, как оказалось, он не силен в математике, поэтому он просит вас
// сосчитать количество дорог. Требуется написать программу, помогающую императору сосчитать
// количество дорог на планете «Snowflake».
//
// Входные данные: в первой строке входного файла INPUT.TXT записано число N (0 ≤ N ≤ 100). В
// следующих N строках записано по N чисел, каждое из которых является единичкой или ноликом.
// Причем, если в позиции (i, j) квадратной матрицы стоит единичка, то i-ый и j-ый города
// соединены дорогами, а если нолик, то не соединены. Гарантируется, что все дороги соединяют
// различные города.
//
// Выходные данные: в выходной файл OUTPUT.TXT необходимо вывести число, определяющее
// количество дорог на планете «Snowflake».
//
// Пример (« / » — переход на новую строку):
//   5 / 0 1 0 0 0 / 1 0 1 1 0 / 0 1 0 0 0 / 0 1 0 0 0 / 0 0 0 0 0 → 3

#include <iostream>

using namespace std;

int main() {

}
