// acmp №16 · Лесенка
// https://acmp.ru/index.asp?main=task&id_task=16
// Сложность: 45%
//
// Лесенкой называется набор кубиков, в котором каждый более верхний слой содержит кубиков
// меньше, чем предыдущий. Требуется написать программу, вычисляющую число лесенок, которое
// можно построить из N кубиков.
//
// Входные данные: во входном файле INPUT.TXT записано натуральное число N (1 ≤ N ≤ 100) –
// количество кубиков в лесенке.
//
// Выходные данные: в выходной файл OUTPUT.TXT необходимо вывести число лесенок, которые
// можно построить из N кубиков.
//
// Примеры:
//   3 → 2
//   6 → 4

#include <iostream>
#include <vector>

using namespace std;

int main() {
    int n;
    cin >> n;

    int count_l = 0;
    vector<int> ways(n+1, 0);
    ways[0] = 1;

    for (int i=0; i<n; i++) {
        for (int j=0; j<n; j++) {
            
        }
    }
}
