// acmp №23 · Гадание
// https://acmp.ru/index.asp?main=task&id_task=23
// Сложность: 13%
//
// Как и многие другие девочки, Маша любит разные гадания. Некоторое время назад Маша узнала
// новый способ гадать на числах – для какого-нибудь интересующего ее натурального числа n
// надо посчитать сумму всех чисел, на которые n делится без остатка. Маша не очень любит
// арифметику, и попросила вас написать программу, которая автоматизирует процесс гадания.
//
// Входные данные: в единственной строке входного файла INPUT.TXT записано натуральное число
// n (n ≤ 1000), которое Маша была вынуждена сообщить.
//
// Выходные данные: в выходной файл OUTPUT.TXT выведите сумму всех натуральных делителей
// числа n.
//
// Примеры:
//   6 → 12
//   10 → 18

#include <iostream>

using namespace std;

int main() {
    int n;
    cin >> n;

    int sum = 0;

    for (int i=1; i<=n; i++) {
        if (n % i == 0) {
            sum += i;
        }
    }

    cout << sum;
}
