// acmp №26 · Две окружности
// https://acmp.ru/index.asp?main=task&id_task=26
// Сложность: 17%
//
// На плоскости даны две окружности. Требуется проверить, имеют ли они хотя бы одну общую
// точку.
//
// Входные данные: входной файл INPUT.TXT состоит из двух строк. На каждой строке записана
// информация об одной окружности – координаты ее центра x и y (целые числа, по модулю не
// превосходящие 5000) и радиус (целое число 1 ≤ r ≤ 1000).
//
// Выходные данные: в выходной файл OUTPUT.TXT выведите «YES», если окружности имеют хотя бы
// одну общую точку, и «NO» в противном случае.
//
// Примеры (« / » — переход на новую строку):
//   0 0 2 / 0 3 2 → YES
//   1 1 1 / 4 4 1 → NO

#include <iostream>

using namespace std;

int main() {

    int x1, y1, r1;
    int x2, y2, r2;


    cin >> x1 >> y1 >> r1;
    cin >> x2 >> y2 >> r2;

    int dx = x1 - x2;
    int dy = y1 - y2;

    int d=dx*dx + dy*dy;

    if (d > (r1+r2)*(r1+r2) 
        or
        d < (r1-r2)*(r1-r2)) {
        cout << "NO";
    }else {
        cout << "YES";
    }

}
