// acmp №54 · Теория игр
// https://acmp.ru/index.asp?main=task&id_task=54
// Сложность: 28%
//
// Одним из интересных объектов, изучаемых в теории игр, являются так называемые
// антагонистические игры двух лиц. Такие игры характеризуются множеством X стратегий
// первого игрока, множеством Y стратегий второго игрока и функцией выигрыша K(x, y) (x из
// X, y из Y). Если множества стратегий X и Y конечны, то такую игру принято называть
// матричной, так как функцию выигрыша K в этом случае удобно задавать матрицей.
//
// Рассмотрим матричную игру, в которой X = {1,…,n}, Y = {1,…,m}. Матрицу выигрышей
// обозначим символом K. Нижним значением игры назовем число max(i=1..n) min(j=1..m) Kij.
// Верхним значением игры назовем число min(j=1..m) max(i=1..n) Kij. Отметим также, что
// игры, у которых нижнее и верхнее значение совпадают, называются играми с седловой
// точкой.
//
// Задана матрица выигрышей K для некоторой матричной игры. Найдите ее верхнее и нижнее
// значение.
//
// Входные данные: первая строка входного файла INPUT.TXT содержит целые числа n и m (1 ≤
// n, m ≤ 100). Далее следуют n строк по m чисел в каждой. j-ое число i-ой строки равно
// Kij. Все Kij по модулю не превосходят 1000.
//
// Выходные данные: в выходной файл OUTPUT.TXT выведите нижнее и верхнее значение игры
// через пробел.
//
// Примеры (« / » — переход на новую строку):
//   3 3 / 4 -1 -3 / -2 1 3 / 0 2 -3 → -2 2
//   3 4 / -1 0 2 1 / -2 0 1 0 / 2 1 -1 -2 → -1 1

#include <iostream>
#include <vector>

using namespace std;

int main() {
    int n, m;
    cin >> n >> m;
    vector<vector<int>> a(n, vector<int>(m));


    for (int i=0; i<n; i++) {
        for (int j=0; j<m; j++) {
            cin >> a[i][j];
        }
    }


    int lower = -2000;

    for (int i=0; i<n; i++) {

        int row_min = a[i][0];

        for (int j=0; j<m; j++) {
            if (a[i][j] < row_min) {
                row_min = a[i][j];
            }
        }

        if (row_min > lower) {
            lower = row_min;
        }
    }

    int upper = 2000;

    for (int j=0; j<m; j++) {

        int col_max = a[0][j];

        for (int i=0; i<n; i++) {
            if (a[i][j] > col_max) {
                col_max = a[i][j];
            }
        }
        
        if (col_max < upper) {
            upper = col_max;
        }
    }

    cout << lower << " " << upper;

}
