// acmp №61 · Баскетбол
// https://acmp.ru/index.asp?main=task&id_task=61
// Сложность: 5%
//
// Известны результаты каждой из 4х четвертей баскетбольной встречи. Нужно определить
// победителя матча. Побеждает команда, набравшая больше очков в течение всего матча.
//
// Входные данные: входной файл INPUT.TXT содержит 4 строки, в каждой строке находится два
// целых числа a и b – итоговый счет в соответствующей четверти. а – количество набранных
// очков за четверть первой командой, b – количество очков, набранных за четверть второй
// командой. (0 ≤ a, b ≤ 100).
//
// Выходные данные: в выходной файл OUTPUT.TXT выведите номер выигравшей команды, в случае
// ничьей следует вывести «DRAW».
//
// Примеры (« / » — переход на новую строку):
//   26 17 / 13 15 / 19 11 / 14 16 → 1
//   14 15 / 17 18 / 20 20 / 15 17 → 2
//   15 16 / 18 17 / 10 12 / 14 12 → DRAW

#include <iostream>

using namespace std;

int main() {
    
}
