// acmp №81 · Арбузы
// https://acmp.ru/index.asp?main=task&id_task=81
// Сложность: 14%
//
// Иван Васильевич пришел на рынок и решил купить два арбуза: один для себя, а другой для
// тещи. Понятно, что для себя нужно выбрать арбуз потяжелей, а для тещи полегче. Но вот
// незадача: арбузов слишком много и он не знает как же выбрать самый легкий и самый тяжелый
// арбуз? Помогите ему!
//
// Входные данные: в первой строке входного файла INPUT.TXT задано одно число N – количество
// арбузов. Вторая строка содержит N чисел, записанных через пробел. Здесь каждое число – это
// масса соответствующего арбуза. Все числа натуральные и не превышают 30000.
//
// Выходные данные: в выходной файл OUTPUT.TXT нужно вывести два числа через пробел: массу
// арбуза, который Иван Васильевич купит теще и массу арбуза, который он купит себе.
//
// Пример (« / » — переход на новую строку):
//   5 / 5 1 6 5 9 → 1 9

#include <iostream>
#include <vector>

using namespace std;

int main() {
    int melon_s;
    cin >> melon_s;

    vector<int> melon;

    for (int i=0; i<melon_s; i++) {
        int u;
        cin >> u;

        melon.push_back(u);
    }

    int max = 0;
    int min = melon[0];

    // min
    for (int i=0; i<melon.size(); i++) {
        if (melon[i] < min) {
            min = melon[i];
        }
    }

    // max
    for (int i=0; i<melon.size(); i++) {
        if (melon[i] > max) {
            max = melon[i];
        }
    }

    cout << min << " " << max;

}
