// acmp №267 · Ксерокопии
// https://acmp.ru/index.asp?main=task&id_task=267
// Сложность: 38%
// Время: 0,2 сек.
//
// Секретарша Ирочка сегодня опоздала на работу и ей срочно нужно успеть к обеду сделать N
// копий одного документа. В ее распоряжении имеются два ксерокса, один из которых копирует
// лист за х секунд, а другой – за y секунд. (Разрешается использовать как один ксерокс,
// так и оба одновременно. Можно копировать не только с оригинала, но и с копии.) Помогите
// ей выяснить, какое минимальное время для этого потребуется.
//
// Входные данные: во входном файле INPUT.TXT записаны три натуральных числа N, x и y,
// разделенные пробелом (1 ≤ N ≤ 2·10^8, 1 ≤ x, y ≤ 10).
//
// Выходные данные: в выходной файл OUTPUT.TXT выведите одно число – минимальное время в
// секундах, необходимое для получения N копий.
//
// Примеры:
//   4 1 1 → 3
//   5 1 2 → 4

#include <iostream>
#include <algorithm>

using namespace std;

int main() {
    long long n, x, y;
    cin >> n >> x >> y;

    long long first;
    if (x > y) {
        first = y;
    } else {
        first = x;
    }

    long long lo = 0;
    long long hi = 2000000000;

    while (lo < hi) {
        long long mid = (lo + hi) / 2;

        if (mid / x + mid / y >= n-1) {
            hi = ;
        } else {
            lo = ;
        }
    }

    cout << first + ;
    
}
