// acmp №514 · Лестница
// https://acmp.ru/index.asp?main=task&id_task=514
// Сложность: 14%
//
// Мальчик Петя строит из кубиков лестницу. Лестница представляет собой несколько
// строящихся рядом башенок из кубиков, каждая из которых ровно на один кубик выше
// предыдущей. Требуется по имеющемуся у мальчика Пети числу кубиков определить, какой в
// кубиках будет высота последней ступеньки.
//
// Входные данные: входной файл INPUT.TXT содержит число К – количество кубиков у мальчика
// Пети (1 ≤ K ≤ 10^6).
//
// Выходные данные: в выходной файл OUTPUT.TXT выведите количество кубиков в последней
// ступеньке у максимально высокой лестницы, которую можно построить из K кубиков.
//
// Примеры:
//   1 → 1
//   4 → 2
//   6 → 3

#include <iostream>

using namespace std;

int main() {

    int n;
    cin >> n;

    int used = 0;
    int h = 0;

    while(used + (h+1) <= n) {
        h++;
        used = used+h;
    }

    cout << h;
}
