// acmp №597 · Внеземные гости
// https://acmp.ru/index.asp?main=task&id_task=597
// Сложность: 10%
//
// Недавно на поле фермера Джона были обнаружены следы приземления летающих тарелок. Об этом
// даже писала газета Mew Yorc Courier.
//
// Поле фермера Джона имеет форму круга радиусом r1. По сообщениям журналистов были
// обнаружены два следа от летающих тарелок, имевшие форму кругов. Один из них имел радиус
// r2, второй - радиус r3. Также сообщается, что они находились внутри поля фермера Джона и
// не пересекались, ни один из них не лежал внутри другого. При этом, они, возможно, касались
// друг друга и/или границы поля.
//
// Поскольку журналисты часто склонны преувеличивать масштабы событий, необходимо написать
// программу, которая будет проверять, могли ли иметь место события, описанные в газете.
//
// Входные данные: первая строка входного файла INPUT.TXT содержит три положительных целых
// числа через пробел - r1, r2, r3 (1 ≤ r1, r2, r3 ≤ 10^9).
//
// Выходные данные: в выходной файл OUTPUT.TXT выведите слово YES, если информация,
// опубликованная в газете, может соответствовать правде, и слово NO - иначе.
//
// Примеры:
//   10 10 10 → NO
//   10 3 4 → YES

#include <iostream>

using namespace std;

int main() {
    long long farm_r, r1, r2;

    cin >> farm_r;
    cin >> r1;
    cin >> r2;

    if (r1+r2 <= farm_r) {
        cout << "YES";
    } else {
        cout << "NO";
    }
    
}
