// acmp №685 · Золотой песок
// https://acmp.ru/index.asp?main=task&id_task=685
// Сложность: 10%
//
// Сотрудники завода по производству золотого песка из воздуха решили поправить свое
// финансовое положение. Они пробрались на склад завода, где хранился золотой песок трех
// видов. Один килограмм золотого песка первого вида они смогли бы продать за A1 рублей,
// второго вида – за A2 рублей, а третьего вида – за A3 рублей. Так получилось, что у
// сотрудников оказалось с собой только три емкости: первая была рассчитана на B1 килограмм
// груза, вторая на B2 килограмм, а третья на B3 килограмм. Им надо было заполнить
// полностью все емкости таким образом, чтобы получить как можно больше денег за весь
// песок. При заполнении емкостей нельзя смешивать песок разных видов, то есть, в одну
// емкость помещать более одного вида песка, и заполнять емкости песком так, чтобы один вид
// песка находился более чем в одной емкости.
//
// Требуется написать программу, которая определяет, за какую сумму предприимчивые
// сотрудники смогут продать весь песок в случае наилучшего для себя заполнения емкостей
// песком.
//
// Входные данные: в единственной строке входного файла INPUT.TXT записано 6 натуральных
// чисел A1, A2, A3, B1, B2, B3, записанных в одной строке через пробел. Все числа не
// превосходят 100.
//
// Выходные данные: в единственную строку выходного файла OUTPUT.TXT нужно вывести
// единственное целое число – сумму в рублях, которую смогут сотрудники заработать в случае
// наилучшего для себя заполнения емкостей песком.
//
// Пример:
//   1 2 3 3 2 1 → 14

#include <iostream>
#include <vector>
#include <algorithm>

using namespace std;

int main() {
    int a1, a2, a3, b1, b2, b3;

    vector<int> a(3), b(3);

    for (int i=0; i<3; i++) {
        cin >> a[i];
    }

    for (int i=0; i<3; i++) {
        cin >> b[i];
    }

    sort(a.begin(), a.end());
    sort(b.begin(), b.end());

    int sum = a[0]*b[0] + a[1]*b[1] + a[2]*b[2];
    cout << sum;

}
