// acmp №704 · Деление
// https://acmp.ru/index.asp?main=task&id_task=704
// Сложность: 40%
//
// На квадратном торте размером N×N расставлено M свечей. Определить, можно ли одним
// прямолинейным разрезом разделить торт на две части, равные по площади, так, чтобы все
// свечи оказались на одной половине. Свечи считаем точками. Разрез не может проходить
// через свечу.
//
// Входные данные: первая строка входного файла INPUT.TXT содержит число N (1 < N ≤ 100) –
// длину стороны квадрата. Вторая строка теста содержит число M (0 < M ≤ 100) – количество
// свечей на торте. Третья строка – координаты свечей, разделенные пробелами: X1 Y1 X2 Y2 …
// Xm Ym (0 < Xi, Yi < N), заданные в системе координат с началом в одном из углов квадрата
// и осями – сторонами квадрата. Все исходные данные - целые положительные числа.
// Координаты всех свечей различны.
//
// Выходные данные: в выходной файл OUTPUT.TXT выведите YES, если такое разделение
// возможно, или NO в противном случае.
//
// Примеры (« / » — переход на новую строку):
//   6 / 4 / 1 1 2 2 1 2 2 1 → YES
//   20 / 10 / 1 1 2 2 1 2 2 1 10 10 3 4 7 2 3 8 2 11 11 3 → NO

#include <iostream>
#include <vector>

using namespace std;

int main() {
    int n, m;
    cin >> n;
    cin >> m;

    vector<int> xs, ys; 

    for (int i=0; i<m; i++) {
        int x,y;
        cin >> x >> y;
        xs.push_back(x);
        ys.push_back(y);
    }

}
