// acmp №818 · Кипячение чая
// https://acmp.ru/index.asp?main=task&id_task=818
// Сложность: 14%
//
// В эту субботу у Васи день рождения, и через 15 минут к нему придут гости. Ему срочно
// надо вскипятить чай, для того чтобы напоить им гостей. У Васи дома есть много литровых
// чайников (можно считать, что их бесконечное количество), а розетка всего одна. Т.к. вода
// кипятится очень долго, за 15 минут она успеет вскипятиться максимум один раз. Но Вася –
// мальчик не промах, он достал из кладовки N тройников, в i-том тройнике ai разъемов.
// Теперь Вася ломает голову: как ему соединить тройники и воткнуть эту систему в розетку,
// чтобы максимизировать количество чайников, которые он сможет поставить кипятить.
//
// Ваша задача заключается в написании программы, которая определит максимальное число
// чайников, которые возможно использовать для кипячения чая, используя данные тройники.
//
// Входные данные: в первой строке входного файла INPUT.TXT содержится число N (1 ≤ N ≤
// 10^5) – количество тройников. Во второй строке через пробел перечислены числа ai (1 ≤ ai
// ≤ 1000, 1 ≤ i ≤ N) – информация о тройниках.
//
// Выходные данные: в выходной файл OUTPUT.TXT выведите ответ на задачу.
//
// Примеры (« / » — переход на новую строку):
//   1 / 1 → 1
//   3 / 2 5 4 → 9

#include <iostream>
#include <vector>

using namespace std;

int main() {
    int n;
    cin >> n;

    vector<int> tr_count;
    int j;

    int result = 0;

    for (int i=0; i<n; i++) {
        cin >> j;
        tr_count.push_back(j);

        result = result+j;
    }

    n = n-1;
    result = result-n;
    cout << result;
}