// acmp №1 · A+B
// https://acmp.ru/index.asp?main=task&id_task=1
// Сложность: 2%
//
// Требуется сложить два целых числа А и В.
//
// Входные данные: в единственной строке входного файла INPUT.TXT записаны два натуральных
// числа через пробел. Значения чисел не превышают 10^9.
//
// Выходные данные: в единственную строку выходного файла OUTPUT.TXT нужно вывести одно
// целое число — сумму чисел А и В.
//
// Пример:
//   2 3 → 5

#include <iostream>

using namespace std;

int main() {
    int a;
    int b;

    cin >> a;
    cin >> b;
    
    int sum = a + b;
    cout << sum;
}