// acmp №2 · Сумма
// https://acmp.ru/index.asp?main=task&id_task=2
//
// Требуется посчитать сумму целых чисел, расположенных между числами 1 и N включительно.
//
// Входные данные: в единственной строке входного файла INPUT.TXT записано единственное
// целое число N, не превышающее по абсолютной величине 10^4.
//
// Выходные данные: в единственную строку выходного файла OUTPUT.TXT нужно вывести одно
// целое число — сумму чисел, расположенных между 1 и N включительно.
//
// Пример:
//   5 → 15

#include <iostream>

using namespace std;

int main() {
    int sum = 0;
    int n;
    cin >> n;
    if (n > 0) {
        for (int i = 0; i <= n; i++) {
            sum += i;
        }
    } else{
        for (int i=n; i<=1; i++) {
            sum+= i;
        }
    }

    cout<<sum;
}