// acmp №6 · Шахматы
// https://acmp.ru/index.asp?main=task&id_task=6
//
// Совсем недавно Вася занялся программированием и решил реализовать собственную программу
// для игры в шахматы. Но у него возникла проблема определения правильности хода конем,
// который делает пользователь. Т.е. если пользователь вводит значение «C7-D5», то программа
// должна определить это как правильный ход, если же введено «E2-E4», то ход неверный. Также
// нужно проверить корректность записи ввода: если например, введено «D9-N5», то программа
// должна определить данную запись как ошибочную. Помогите ему осуществить эту проверку!
//
// Входные данные: в единственной строке входного файла INPUT.TXT записан текст хода
// (непустая строка), который указал пользователь. Пользователь не может ввести строку,
// длиннее 5 символов.
//
// Выходные данные: в выходной файл OUTPUT.TXT нужно вывести «YES», если указанный ход конем
// верный, если же запись корректна (в смысле правильности записи координат), но ход
// невозможен, то нужно вывести «NO». Если же координаты не определены или заданы
// некорректно, то вывести сообщение «ERROR».
//
// Примеры:
//   C7-D5 → YES
//   E2-E4 → NO
//   BSN → ERROR

#include <string>
#include <cstdlib>
#include <iostream>

using namespace std;


bool hours_g(int dx, int dy) {
    return ((abs(dx)==1 and abs(dy)==2) or (abs(dx)==2 and abs(dy)==1));
}

int main() {
    string s;
    cin >> s;
 
    if (false){
        cout << "ERROR";
    } else {
        int dx = s[0] - s[3];
        int dy = s[1] - s[4];
        if (hours_g(dx, dy)) {
            cout << "YES";
        } else {cout << "NO";}
    }
}