// acmp №1702 · Сортировка выбором
// https://acmp.ru/index.asp?main=task&id_task=1702
// Сложность: 24%
//
// В этой задаче вам предлагается реализовать сортировку выбором.
//
// Задан массив целых чисел a_0, a_1, …, a_n−1. Отсортируем его следующим образом:
//   - выберем наибольший элемент массива и поменяем его местами с последним элементом (если последний
//     и есть найденный максимум, то обмен можно не совершать),
//   - исключим из рассмотрения последний элемент и если длина оставшегося участка больше нуля перейдем
//     опять к предыдущему пункту.
// Таким образом, этот алгоритм состоит их n фаз, на каждой из которых выбирается максимум.
// Ваша задача реализовать эту сортировку описанным способом и вывести n чисел — индексы
// максимума на каждой из n фаз. Если максимум встречается более одного раза, то надо всегда
// выбирать первый из них.
//
// Входные данные: в первой строке входного файла INPUT.TXT задано одно целое число n (1 ≤ n
// ≤ 1000) — количество элементов в массиве. Во второй строке задано n целых чисел через
// пробел: a_0, a_1, …, a_n−1 (|a_i| ≤ 10^9) — элементы массива.
//
// Выходные данные: в выходной файл OUTPUT.TXT выведите n чисел через пробел, где число i —
// это индекс первого максимального элемента на i-й фазе алгоритма.
//
// Примеры (« / » — переход на новую строку):
//   5 / 40 30 20 40 20 → 0 3 1 0 0
//   3 / 1 2 3 → 2 1 0

#include <iostream>
#include <vector>

using namespace std;

vector<int> selectionSort(vector<long long>& arr) {
    vector<int> result;

    for (int end = arr.size() - 1; end >= 0; end--) {
        int max_idx = 0;
        for (int j = 1; j <= end; j++) {
            if (arr[j] > arr[max_idx]) {
                max_idx = j;
            }
        }
        result.push_back(max_idx);
        swap(arr[max_idx], arr[end]);
    }

    return result;
}

int main() {
    int n;
    cin >> n;
    vector<long long> arr(n);
    for (int i = 0; i < n; i++) {
        cin >> arr[i];
    }

    vector<int> result = selectionSort(arr);
    for (int i = 0; i < result.size(); i++) {
        cout << result[i] << " ";
    }
    cout << endl;

    return 0;
}
